/* Вы уже знаете о существовании функции alert, выводящей заданное сообщение на экран. Существует также похожая функция prompt, которая позволяет получить от пользователя какой-либо текст. */

// let name = prompt('Ваше имя?')
// alert('Your name - ' + name)

// or

// alert('Ваше имя - ' + prompt('Ваше имя?'))

// alert('Ваш возраст ' + prompt('Сколько вам лет?'))

// let num1 = prompt('Введите первое число');
// let num2 = prompt('Введите второе число')

// alert(+num1 + +num2)


// let line = prompt('Какова длина стороны квадрата? (введите число)')
// alert('Площадь квадрата равна ' + line**2)

let a = prompt('Введите длину прямоугольника (число)')
let b = prompt('Введите ширину прямоугольника (число')
alert('Периметр прямоугольна равен ' + (+(2*a) +(2*b)))