// Элементы массива могут быть не только строками и числами, но и массивами. В этом случае у нас получится массив массивов или многомерный массив.
// let arr = [
// 	['a', 'b', 'c'],
// 	['d', 'e', 'f'],
// 	['g', 'h', 'i'],
// 	['j', 'k', 'l'],
// ];
// console.log(arr[3][2], arr[1][1], arr[2][0], arr[0][0]);


// let arr = [[1, 2], [3, 4], [5, 6]];
// let sum = 0;
// for (i = 0; i < 2; i++){
//   sum += arr[0][i];
//   sum += arr[1][i];
//   sum += arr[2][i];
// }
// console.log(sum);


// let arr = [
// 	[
// 		[1, 2],
// 		[3, 4],
// 	],
// 	[
// 		[5, 6],
// 		[7, 8],
// 	],
// ];
// let sum = 0;
// for(i = 0; i < 2; i++){
//   sum += arr[0][0][i];
//   sum += arr[0][1][i];
//   sum += arr[1][0][i];
//   sum += arr[1][1][i];
// }
// console.log(sum);

// Произвольные масивы 

let arr = [[1, 2, 3, [4, 5, [6, 7]]], [8, [9, 10]]]; 
let sum = arr[0][0] + arr[0][1] + arr[0][2] + arr[0][3][0] + arr[0][3][1] + arr[0][3][2][0] +arr[0][3][2][1] + arr[1][0] + arr[1][1][0] + arr[1][1][1];
console.log(sum);