/* Начнем наше изучение циклов с цикла while. Этот цикл будет выполняться до тех пор, пока верно (истинно) выражение, переданное ему параметром. Смотрите синтаксис: */

/* Цикл закончится, когда выражение перестанет быть истинным. Если оно было ложным изначально - то он не выполнится ни разу! */

  // let i = 1;
  // while(i <= 5) {
  //   console.log(i);
  //   i++;
  // }

/* Переменная i называется счетчиком цикла. Счетчики используются для того, чтобы подсчитывать, сколько раз выполнился цикл. Кроме того, они выполняют вспомогательную роль - в нашей задаче мы использовали счетчик, чтобы вывести цифры от 1 до 5.

Для счетчиков принято использовать буквы i, j и k.*/


// let i = 1;

// while (i <= 100) {
//   console.log(i);
//   i++;
// }

// let i = 11;

// while (i <= 33) {
//   console.log(i);
//   i++;
// }


// Более сложный цикл

  // let i = 2;

  // while (i <= 10) {
  //   console.log(i);
  //   i += 2;
    
  // }

  // let i = 0;

  // while (i <= 100) {
  //   console.log(i);
  //   i += 2
  // }

  // let i = 1;

  // while (i <= 99) {
  //   console.log(i);
  //   i += 2
  // }

// Обратный отсчет

  // let i = 10;

  // while (i >= 1) {
  //   console.log(i);
  //   i--;
  // }

  let i = 30;

  while (i >= 0) {
    console.log(i);
    i--;
    
  }
