//Выведите с помощью цикла столбец чисел от 1 до 100.

  // for(i = 1; i <= 100; i++){
  //   document.write(i + '<br>')
  // }

// Выведите с помощью цикла столбец чисел от 100 до 1.

  // for(i = 100; i > 0; i--){
  //   document.write(i + '<br>')
  // }


//Выведите с помощью цикла столбец четных чисел от 1 до 100.

  // for(i = 0; i <= 100; i += 2){
  //   document.write(i + '<br>')
  // }


// Заполните массив 10-ю иксами с помощью цикла.
  // let arr = [];

  // for(i = 0; i < 10; i++){
  //   arr.push('x')
  // }
  // console.log(arr);


// Заполните массив числами от 1 до 10 с помощью цикла

  // let arr = [];

  // for (i = 1; i <= 10; i++){
  //   arr.push(i);
  // }
  // console.log(arr)
  
//Дан массив с числами. С помощью цикла выведите только те элементы массива, которые больше нуля и меньше 10-ти.

  // let arr = [1, -2, -3, -5, 15, 5, 6, 7];

  // for(i = 0; i < arr.length; i++){
  //   if (arr[i] > 0 && arr [i] < 10) {
  //     document.write(arr[i] + '<br>');
  //   }
  // }

// Дан массив с числами. С помощью цикла проверьте, что в нем есть элемент со значением 5.
  // let arr = [1, -2, -3, -5, 15, 5, 6, 7];
  // let res = false;

  // for (i = 0; i < arr.length; i++){
  //   if(arr[i] === 5) {
  //     res = true;
  //     break;
  //   }
  // }
  // alert(res)


// Дан массив с числами. С помощью цикла найдите сумму элементов этого массива.
  // let arr = [1, -2, -3, -5, 15, 5, 6, 7];
  // let sum = 0;

  // for(i = 0; i < arr.length; i++){
  //   sum += arr[i];
  // }
  // alert(sum);


// Дан массив с числами. С помощью цикла найдите сумму квадратов элементов этого массива.

  // let arr = [1, -2, -3, -5, 15, 5, 6, 7];
  // let sum = 0;

  // for (i = 0; i < arr.length; i++){
  //   sum += arr[i]**2
  // }
  // console.log(sum);



// Дан массив с числами. Найдите среднее арифметическое его элементов (сумма элементов, делить на количество).
  // let arr = [1, -2, -3, -5, 15, 5, 6, 7];
  // let sum = 0;
  // for(i = 0; i < arr.length; i++){
  //   sum += arr[i];
  // }
  // console.log(sum / arr.length);

//Напишите скрипт, который будет находить факториал числа. Факториал (обозначается !) - это произведение (умножение) всех целых чисел, меньше данного, и его самого. Например, 4! = 1*2*3*4.

  // let num = 6;
  // let factorialNum = 1;
  // for(i = num; i > 0; i--){
  //   factorialNum *= i
  // }
  // console.log(factorialNum);

